<template>
  <div class="tab-content">
    <h1 class="tab-title">Аренда серверов</h1>
    <div class="slider-container">
      <Slider :images="sliderImages" />
    </div>
    <p class="tab-text">
      Добро пожаловать на нашу платформу аренды серверов! Мы предоставляем широкий спектр высококачественных серверов для удовлетворения ваших потребностей в хостинге и облачных вычислениях.
    </p>
    <p class="tab-text">
      Независимо от того, нужен вам сервер для хранения и обработки данных, развертывания веб-приложений или запуска игрового сервера, у нас есть подходящий вариант для вас. Мы предлагаем гибкую систему тарифов, которая позволяет вам выбрать ресурсы и мощность сервера в соответствии с вашими требованиями.
    </p>
    <p class="tab-text">
      Наши серверы обеспечивают высокую производительность, надежность и безопасность данных. Мы предлагаем возможности масштабирования, резервного копирования и мониторинга, чтобы у вас была полная контроль и гибкость в управлении вашими серверами.
    </p>
    <p class="tab-text">
      Мы готовы помочь вам с выбором и настройкой сервера, чтобы удовлетворить ваши уникальные потребности. Свяжитесь с нами сегодня и начните использовать мощные серверные ресурсы для вашего бизнеса или проекта.
    </p>
    <div>
  </div>
  </div>
</template>

<script>
import Slider from '@/components/TheSlider.vue'

export default {
  name: 'HomePage',
  components: {
    Slider
  },
  data () {
    return {
      sliderImages: [
        'images/1.jpg',
        'images/2.jpg',
        'images/3.jpg',
        'images/4.jpg',
        'images/5.jpg',
        'images/6.jpg',
        'images/7.jpg',
        'images/8.jpg'
        // Добавьте пути к изображениям, которые вы хотите отобразить в слайдере
      ]
    }
  }
}
</script>
